
# üìò Pr√°ctica SQL ‚Äì Fintech Databank

Este notebook contiene los **ejercicios pr√°cticos** sobre la base de datos `fintech_databank.db`.  
Tu objetivo ser√° escribir consultas SQL para resolver cada problema.

üëâ **Recuerda:** conecta la base de datos antes de empezar:
```python
%sql sqlite:////content/drive/MyDrive/ClassFilesIDA/fintech_databank.db
```

In [ ]:
#se desmonta y se monta la unidad por que estoy verificando el archivo nuevo constantemente
from google.colab import drive
drive.flush_and_unmount()
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
!pip install -q "prettytable==3.11.0" ipython-sql sqlalchemy

In [ ]:
%load_ext sql


## üîπ Instrucciones generales
1. Con√©ctate a la base de datos.  
2. Antes de cada ejercicio, revisa las tablas disponibles con:
   ```sql
   %%sql
   SELECT name FROM sqlite_master WHERE type='table';
   ```
3. Ejecuta tus consultas SQL en las celdas de c√≥digo marcadas como `%%sql`.  
4. Guarda tus respuestas en este notebook.

In [ ]:
%sql sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db

In [ ]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('clientes',), ('cuentas',), ('transacciones',), ('tipos_cambio',)]

## **Ejercicio 1. Exploraci√≥n b√°sica**


###- Lista todas las filas de la tabla **clientes**.

In [ ]:
%%sql
select * from clientes;

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('C001', 'Ana Torres', 'CDMX', 'Retail'),
 ('C002', 'Luis G√≥mez', 'Guadalajara', 'Retail'),
 ('C003', 'Textiles J&R', 'Monterrey', 'PYME')]

###- Muestra √∫nicamente el nombre y la ciudad de cada cliente.

In [ ]:
%%sql
select nombre, ciudad from clientes;

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('Ana Torres', 'CDMX'),
 ('Luis G√≥mez', 'Guadalajara'),
 ('Textiles J&R', 'Monterrey')]

###- ¬øCu√°ntos clientes hay en total?

In [ ]:
%%sql
select count(*) as numero_clientes from clientes;

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[(3,)]

## **Ejercicio 2. Cuentas de clientes**

### REVISION

In [ ]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('clientes',), ('cuentas',), ('transacciones',), ('tipos_cambio',)]

###- Obt√©n todas las cuentas del cliente **C001**.

In [ ]:
%%sql
SELECT * FROM cuentas WHERE cliente_id = 'C001';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('A1001', 'C001', 'MXN', 'Vista', '2024-11-10'),
 ('A1002', 'C001', 'USD', 'Ahorro', '2024-12-01')]

### - Lista las cuentas que est√°n en moneda **USD**.

In [ ]:
%%sql
select * from cuentas where moneda = 'USD';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('A1002', 'C001', 'USD', 'Ahorro', '2024-12-01')]

### - Muestra el n√∫mero de cuentas que tiene cada cliente (usa `GROUP BY`).

In [ ]:
%%sql
select cliente_id, count(*) as num_cuentas from cuentas group by cliente_id;

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('C001', 2), ('C002', 1), ('C003', 1)]

## **Ejercicio 3. Transacciones**

### REVISION

In [ ]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('clientes',), ('cuentas',), ('transacciones',), ('tipos_cambio',)]

### Transacciones

In [ ]:
%%sql
select * from transacciones;

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('T0001', 'A1001', '2025-07-01', 'N√≥mina', 25000, 'Dep√≥sito'),
 ('T0002', 'A1001', '2025-07-03', 'Renta', -12000, 'Pago'),
 ('T0003', 'A1001', '2025-07-05', 'Super', -2200, 'Pago'),
 ('T0004', 'A1002', '2025-07-07', 'Ahorro mensual', 800, 'Dep√≥sito'),
 ('T0005', 'A2001', '2025-07-02', 'Inter√©s mensual', 120, 'Inter√©s'),
 ('T0006', 'A2001', '2025-07-04', 'Comisi√≥n manejo', -45, 'Comisi√≥n'),
 ('T0007', 'A3001', '2025-07-10', 'Pago n√≥mina empleados', -68000, 'Pago'),
 ('T0008', 'A3001', '2025-07-12', 'Transferencia cliente', 95000, 'Transferencia'),
 ('T0009', 'A1001', '2025-07-15', 'Comisi√≥n retiro', -35, 'Comisi√≥n'),
 ('T0010', 'A1002', '2025-07-20', 'Inter√©s mensual', 3.5, 'Inter√©s')]

###- Obt√©n todas las transacciones de la cuenta **A1001**.

In [ ]:
%%sql
select * from transacciones where cuenta_id = 'A1001';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('T0001', 'A1001', '2025-07-01', 'N√≥mina', 25000, 'Dep√≥sito'),
 ('T0002', 'A1001', '2025-07-03', 'Renta', -12000, 'Pago'),
 ('T0003', 'A1001', '2025-07-05', 'Super', -2200, 'Pago'),
 ('T0009', 'A1001', '2025-07-15', 'Comisi√≥n retiro', -35, 'Comisi√≥n')]

###- Calcula el **saldo neto** de esa cuenta sumando la columna `monto`.

In [ ]:
%%sql
select sum(monto) as saldo_neto from transacciones where cuenta_id = 'A1001';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[(10765,)]

###- Lista las transacciones que sean **comisiones**.

In [ ]:
%%sql
select * from transacciones where concepto IN ('Comisi√≥n manejo','Comisi√≥n retiro');

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('T0006', 'A2001', '2025-07-04', 'Comisi√≥n manejo', -45, 'Comisi√≥n'),
 ('T0009', 'A1001', '2025-07-15', 'Comisi√≥n retiro', -35, 'Comisi√≥n')]

In [ ]:
%%sql
select * from transacciones where categoria = 'Comisi√≥n';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('T0006', 'A2001', '2025-07-04', 'Comisi√≥n manejo', -45, 'Comisi√≥n'),
 ('T0009', 'A1001', '2025-07-15', 'Comisi√≥n retiro', -35, 'Comisi√≥n')]

## **Ejercicio 4. Reportes con agrupaciones**

### REVISION

In [ ]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('clientes',), ('cuentas',), ('transacciones',), ('tipos_cambio',)]


###- Calcula el total de transacciones (suma de `monto`) por **categor√≠a**.

In [ ]:
%%sql
select categoria, sum(monto) as total_transacciones
from transacciones group by categoria;

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('Comisi√≥n', -80),
 ('Dep√≥sito', 25800),
 ('Inter√©s', 123.5),
 ('Pago', -82200),
 ('Transferencia', 95000)]


## **Ejercicio 5. Modificar datos (UPDATE)**

> **Objetivo:** actualizar valores existentes usando `WHERE` de forma segura.

> **Tip:** siempre valida primero con un `SELECT` y despu√©s aplica el `UPDATE`.

### REVISION

In [ ]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('clientes',), ('cuentas',), ('transacciones',), ('tipos_cambio',)]

### 1. Cambia el `segmento` del cliente **C002** de *Retail* a **PYME**.

In [ ]:
#PRIMERO SELECT
%%sql
select * from clientes where cliente_id = 'C002';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('C002', 'Luis G√≥mez', 'Guadalajara', 'Retail')]

In [ ]:
#AHORA UPDATE
%%sql
update clientes set segmento = 'PYME' where cliente_id = 'C002';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
1 rows affected.

[]

### 2. Corrige la `ciudad` de **Textiles J&R (C003)** a **Saltillo**.

In [ ]:
#PRIMERO SELECT
%%sql
select * from clientes where cliente_id = 'C003';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('C003', 'Textiles J&R', 'Monterrey', 'PYME')]

In [ ]:
#ahora UPDATE
%%sql
update clientes set ciudad = 'Saltillo' where cliente_id = 'C003';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
1 rows affected.

[]

###VERIFICACI√ìN

In [ ]:
%%sql
select * from clientes;

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('C001', 'Ana Torres', 'CDMX', 'Retail'),
 ('C002', 'Luis G√≥mez', 'Guadalajara', 'PYME'),
 ('C003', 'Textiles J&R', 'Saltillo', 'PYME')]


## **Ejercicio 6. Borrar datos (DELETE)**

> **Objetivo:** eliminar filas espec√≠ficas manteniendo la integridad y usando `WHERE`.

> **Tip:** prueba primero con `SELECT` para verificar el subconjunto a borrar.

### VERIFICACION

In [ ]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('clientes',), ('cuentas',), ('transacciones',), ('tipos_cambio',)]

In [ ]:
%%sql
select * from transacciones;

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('T0001', 'A1001', '2025-07-01', 'N√≥mina', 25000, 'Dep√≥sito'),
 ('T0002', 'A1001', '2025-07-03', 'Renta', -12000, 'Pago'),
 ('T0003', 'A1001', '2025-07-05', 'Super', -2200, 'Pago'),
 ('T0004', 'A1002', '2025-07-07', 'Ahorro mensual', 800, 'Dep√≥sito'),
 ('T0005', 'A2001', '2025-07-02', 'Inter√©s mensual', 120, 'Inter√©s'),
 ('T0006', 'A2001', '2025-07-04', 'Comisi√≥n manejo', -45, 'Comisi√≥n'),
 ('T0007', 'A3001', '2025-07-10', 'Pago n√≥mina empleados', -68000, 'Pago'),
 ('T0008', 'A3001', '2025-07-12', 'Transferencia cliente', 95000, 'Transferencia'),
 ('T0009', 'A1001', '2025-07-15', 'Comisi√≥n retiro', -35, 'Comisi√≥n'),
 ('T0010', 'A1002', '2025-07-20', 'Inter√©s mensual', 3.5, 'Inter√©s')]

### 1. Elimina **solo** las transacciones de la cuenta`A3001` del d√≠a **2025-07-12**.

In [ ]:
#primero SELECT
%%sql
select * from transacciones where cuenta_id = 'A3001' and fecha = '2025-07-12';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('T0008', 'A3001', '2025-07-12', 'Transferencia cliente', 95000, 'Transferencia')]

In [ ]:
#ahora UPDATE
%%sql
delete from transacciones where cuenta_id = 'A3001' and fecha = '2025-07-12';
"""Como la celda que se elimina corresponde al tx_id "T0008" tambien se podr√≠a eliminar con:
%%sql
delete from transacciones where tx_id = 'T0008';"""

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
1 rows affected.
(sqlite3.OperationalError) near """"Como la celda que se elimina corresponde al tx_id "": syntax error
[SQL: """Como la celda que se elimina corresponde al tx_id "T0008" tambien se podr√≠a eliminar por ahi con:
%%sql
delete from transacciones where tx_id = 'T0008';"""]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

### 2. Elimina la **comisi√≥n** de `A2001` del **2025-07-04**.

In [ ]:
#primero SELECT
%%sql
select * from transacciones where cuenta_id = 'A2001' and fecha = '2025-07-04' and categoria = 'Comisi√≥n';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('T0006', 'A2001', '2025-07-04', 'Comisi√≥n manejo', -45, 'Comisi√≥n')]

In [ ]:
#se elimina solo el monto de esa celda, que corresponde a la comisi√≥n, al menos eso entend√≠ de la instrucci√≥n, eliminar la cantidad de la comisi√≥n
%%sql
update transacciones set monto = 0 where cuenta_id = 'A2001' and fecha = '2025-07-04' and categoria = 'Comisi√≥n';

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
1 rows affected.

[]

###VERIFICACION DE TRANSACCIONES

In [ ]:
%%sql
select * from transacciones;

 * sqlite:////content/drive/MyDrive/MAESTRIA/Ing_Datos/fintech_databank.db
Done.

[('T0001', 'A1001', '2025-07-01', 'N√≥mina', 25000, 'Dep√≥sito'),
 ('T0002', 'A1001', '2025-07-03', 'Renta', -12000, 'Pago'),
 ('T0003', 'A1001', '2025-07-05', 'Super', -2200, 'Pago'),
 ('T0004', 'A1002', '2025-07-07', 'Ahorro mensual', 800, 'Dep√≥sito'),
 ('T0005', 'A2001', '2025-07-02', 'Inter√©s mensual', 120, 'Inter√©s'),
 ('T0006', 'A2001', '2025-07-04', 'Comisi√≥n manejo', 0, 'Comisi√≥n'),
 ('T0007', 'A3001', '2025-07-10', 'Pago n√≥mina empleados', -68000, 'Pago'),
 ('T0009', 'A1001', '2025-07-15', 'Comisi√≥n retiro', -35, 'Comisi√≥n'),
 ('T0010', 'A1002', '2025-07-20', 'Inter√©s mensual', 3.5, 'Inter√©s')]